tutorials/scalingTest/bases/yao-base/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(

    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue alpha.gas 1

    volScalarFieldValue CH4.gas 0
    volScalarFieldValue O2.gas 0.3
    volScalarFieldValue H2O.gas 0
    volScalarFieldValue CO.gas 0
    volScalarFieldValue CO2.gas 0
    volScalarFieldValue N2.gas 0.7

    volScalarFieldValue slag.liquid 1
    volScalarFieldValue alloy.liquid 0
    volScalarFieldValue oxides.liquid 0

);



regions
(


    


    boxToCell
    {
        box (-100 -0.05 -100) (100 0.05 100);

        fieldValues
        (
            volScalarFieldValue alpha.liquid 0.35
            volScalarFieldValue alpha.gas 0.65
    
            volScalarFieldValue CH4.gas 0
            volScalarFieldValue O2.gas 0.3
            volScalarFieldValue H2O.gas 0
            volScalarFieldValue CO.gas 0
            volScalarFieldValue CO2.gas 0
            volScalarFieldValue N2.gas 0.7

            volScalarFieldValue slag.liquid 0.9
            volScalarFieldValue alloy.liquid 0.1
            volScalarFieldValue oxides.liquid 0

        );

    }

);


// ************************************************************************* //

